mathsheet.org
# -*- eval: (add-hook 'after-save-hook (lambda () (save-excursion (org-babel-tangle) (org-export-to-file 'md "README.md"))) nil 'local); -*-
#+title: Math Worksheet Generator
#+author: Ian Martins
#+email: ianxm@jhu.edu
* Overview
** Description
This is a math worksheet generator. The worksheets are randomly
generated based on templates that define what kinds of problems to
include along with the order and relative frequency that each type of
problem should appear on the worksheet.
** Audience
This could be useful for anyone that wants to provide math practice to
someone else. It could be useful for a teacher, tutor, homeschooling
parent, or any parent.
** Examples
Here are some example worksheets generated by this tool:
1. [[file:examples/add-sub-1.pdf][arithmetic]]
2. [[file:examples/algebra-1.pdf][algebra]]

They were generated using [[file:examples/example.org][this configuration]].
** Requirements
[[https://www.gnu.org/software/texinfo/manual/texinfo/html_node/Format-with-texi2dvi-or-texi2pdf.html][texi2pdf]] is required to generate the PDF worksheet. Without it you can
still generate the table of problems and solutions.
** Usage
There are two main components involved in defining a worksheet:
1. the problem templates
2. the problem-set block

Both are described in detail below.
*** Problem Templates
**** Expression Templates
The worksheet is made of a set of math problems. Each problem is
defined by a template that lays out an equation or expression and
shows where variables or numbers should be. For example, consider this
template:
#+begin_example
[0..15] + [1..10]
#+end_example
The parts within the brackets are fields. When a template is made into
a problem and added to a worksheet, each field is replaced by a number
based on a set of rules. The supported rules are described in more
detail below, but ~[0..15]~ means pick a random number between 0 and 15,
inclusive, so the above template could result in problems like these:
#+begin_example
1 + 2
15 + 10
5 + 1
#+end_example
**** Equation Templates
In addition to expressions where the answer is a number, templates can
be equations where the solution is found by solving for the
variable. For example, consider this template:
#+begin_example
[1..5] x + 3 = [-10..10]
#+end_example
This can produce the following problems:
#+begin_example
3 x + 6 = -1
4 x + 2 = 2
1 x + 8 = -3
#+end_example
**** Field Rules
These are the different ways fields can be defined:
- [-2..8] :: choose a random number from -2 to 8, inclusive
- [1,3,5] :: choose randomly from 1, 3 or 5
- [-3..-1,1..3] :: choose a random number from -3 to -1 or 1 to 3
- [10/(2-1)] :: evaluate the expression
- [round(sin(0.3))] :: expressions can use math functions
- [a=...] :: assign the variable ~a~ to the number chosen for this field
- [-2..$a] :: any number from -2 to the value another field assigned
  to ~a~
- [0..[$a/2]] :: any number from 0 to half the value assigned to ~a~.

The ability to keep track of the random number chosen in one field and
use it to influence another allows the template to be written to avoid
answers that are negative or don't divide evenly.

These math functions are allowed: sqrt, sin, cos, tan, asin, acos,
atan, floor, ceil, round. Find more details about each of these
functions in the emacs calc manual.
**** Template Examples
Here are a few more examples:

Division problem that divides evenly
#+begin_example
[$a*[1..5]] / [a=1..10]
#+end_example

Addition and subtraction, but ensure a positive result
#+begin_example
[a=1..10] + [b=0..10] - [0..($a+$b)]
#+end_example

Division but ensure we don't divide by zero
#+begin_example
[-10..10] / [-5..-1,1..5]
#+end_example

*** The Problem Template Table
**** Overview
In order to make it possible to have more than one problem template on
a worksheet, each worksheet is configured with a set of templates in a
templates table. For example

#+name: first-sheet
| weight | order | template            | description            |
|--------+-------+---------------------+------------------------|
|      3 |     1 | [1..10] + [1..20]   | addition               |
|      1 |     2 | [a=1..10] - [0..$a] | subtraction above zero |

The table contains the following columns:
- weight :: The relative number of this type of problem to include on
  the worksheet. A weight of zero means the template will not be
  used. For ~first-sheet~ three out of four of the worksheet problems
  will be addition.
- order :: Problems are ordered on the sheet in ascending order. Two
  problems with the same order will be intermingled. For ~first-sheet~
  all of the addition problems will come first.
- template :: this is the template used to generate problems of this
  type.
- description :: This column is just for your notes. It is not used in
  worksheet generation.

Also notice that the table is assigned a name. That name will be used
to refer to it later.
**** Example
Here is another example template table.

#+name: second-sheet
| weight | order | template                      | description                  |
|--------+-------+-------------------------------+------------------------------|
|      3 |     1 | [1..10] + [0..10]             | simple                       |
|      2 |     2 | [1..10] + [8..15]             | second number bigger         |
|      1 |     2 | [a=3..10] - [0..$a]           | subtraction                  |
|      1 |     3 | [1..10] + [1..7] + [1..5]     | three terms                  |
|      1 |     4 | [a=1..10] + [0..10] - [0..$a] | three terms with subtraction |
|      0 |     0 | [$a*[1..5]] / [a=1..10]       | division                     |
*** The Problem-Set Block
**** Overview
The second thing needed to generate a mathsheet is an [[https://orgmode.org/manual/Dynamic-Blocks.html][org dynamic
block]]. Here is an example:

#+BEGIN: problem-set :templates "first-set" :count 20 :instruction "Compute the solution"
#+END:

The block name must be ~problem-set~ and it must specify the following parameters
- ~:templates~ :: The name of the templates table to use
- ~:count~ :: the total number of problems to put on the sheet
- ~:prob-cols~ :: the number of columns in which to lay out the problems
- ~:instruction~ :: a brief instruction that will be included at the top
  of the sheet to guide the student

@@html:<kbd>@@C-c@@html:</kbd>@@ @@html:<kbd>@@C-c@@html:</kbd>@@ on
the block ~BEGIN~ line or ~END~ line will trigger org-mathsheet to
generate a new set of problems. The new problems and answers will be
written to a table in the body of the dynamic block, and you will have
the option (via a yes/no prompt in the mini bar) to write those
problems to a PDF. On "yes", org-mathsheet will write a PDF to a file
named by the template table name. If an existing file exists it will
be overwritten. On "no", nothing will be written.
**** Example
This is an example problem-set block.

#+BEGIN: problem-set :templates "algebra-1" :count 8 :prob-cols 2 :instruction "Solve for x"
#+END:

* Code walkthrough
** Problem generation
*** Header
This is the standard emacs package header.

~emacs 26~ is needed for ~seq-random-elt~.  ~calc~ is used to solve the
problems as well as converting them to mathematical notation in LaTeX
format.

#+begin_src elisp :tangle org-mathsheet.el
  ;;; org-mathsheet.el --- Generate dynamic math worksheets  -*- lexical-binding:t -*-

  ;; Copyright (C) 2025 Free Software Foundation, Inc.

  ;; Author: Ian Martins <ianxm@jhu.edu>
  ;; Keywords: tools, education, math
  ;; Homepage: https://gitlab.com/ianxm/org-mathsheet
  ;; Version: 1.0
  ;; Package-Requires: ((peg "1.0")
  ;;                    (emacs "26.0")
  ;;                    calc)

  ;; This file is not part of GNU Emacs.

  ;; GNU Emacs is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; GNU Emacs is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with GNU Emacs.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; This package generates dynamic math worksheets. The types and
  ;; distribution of problems is highly customizable. Problem sets are
  ;; defined in org tables, generated in dynamic blocks for review, and
  ;; exported to PDF for printing.

  ;;; Code:
#+end_src

*** Dependencies
This package needs [[https://elpa.gnu.org/packages/peg.html][peg]]. We also need [[https://www.gnu.org/software/emacs/manual/html_mono/calc.html][calc]] and some [[https://orgmode.org/manual/Tables.html][org-table]] and
[[https://orgmode.org/org.html#Working-with-Source-Code][org-babel]] functions.

#+begin_src elisp :tangle org-mathsheet.el
  (require 'peg)
  (require 'calc)

  (declare-function math-read-expr "calc-ext")
  (declare-function org-table-align "org-table")
  (declare-function org-table-to-lisp "org-table")
  (declare-function org-babel-named-data-regexp-for-name "ob-core")
#+end_src

*** Variables
We need ~org-mathsheet--var-list~ to keep track of the variables between fields.

~org-mathsheet--worksheet-template~ is the LaTeX template for the
worksheet, which is defined in a LaTeX source block below. This
assigns the constant directly to that named block.

#+name: variables
#+begin_src elisp :tangle org-mathsheet.el :var page=page
  (defvar org-mathsheet--var-list '()
    "List of variables used in a problem.")

  (defconst org-mathsheet--worksheet-template page
    "LaTeX template for the worksheet.")
#+end_src
