org-mathsheet.el
  "Visit NODE as part of a DFS of the problem.

Traverse the fields of a problem using depth first search to
ensure that field replacement happens in dependency order.
FIELDS is a list of all fields in the problem."
  (pcase (cadddr node)
    (1 (error "Cycle detected")) ; cycle
    (2)                          ; skip
    (_                           ; process
     (setcar (cdddr node) 1)     ; started
     (let ((deps (cadr node)))
       (dolist (dep deps)
         (org-mathsheet--dfs-visit
          (assq dep fields)
          fields)))
     (org-mathsheet--replace-field node) ; visit
     (setcar (cdddr node) 2)))) ; mark done

(defun org-mathsheet--fill-problem (full-problem)
  "Replace all fields in FULL-PROBLEM.

Goes through all fields in the given problem in dependency order
and replaces fields with numbers.  When this completes the problem
will be ready to solve."
    (with-temp-buffer
      ;; stage problem in temp buffer
      (insert full-problem)
      (goto-char (point-min))

      ;; find fields, assignment variables, algebraic variables, dependencies
      (let* ((scan-ret (org-mathsheet--scan-problem))
             (fields (alist-get :fields scan-ret))
             (alg-vars (alist-get :alg-vars scan-ret)))

        ;; visit fields ordered according to dependencies
        (dolist (node fields)
          (org-mathsheet--dfs-visit node fields))
        (setq org-mathsheet--var-list '())

        ;; return filled problem
        `((:problem . ,(buffer-string))
          (:alg-vars . ,alg-vars)))))

(defun org-mathsheet--generate-problems (template-name count)
  "Use templates from TEMPLATE-NAME to generate COUNT problems.

Generate problems and answers based on what is defined in the
given template table.  The template table defines problem
templates as well as relative weights and how they should be
ordered."
  (let (total-weight templates problems)
    (save-excursion
      (goto-char (point-min))
      (search-forward-regexp (org-babel-named-data-regexp-for-name template-name) nil t)

      ;; read table from buffer, drop header, convert fields to numbers or strings
      (setq templates (mapcar
                       (lambda (row) (list (string-to-number (nth 0 row))
                                           (string-to-number (nth 1 row))
                                           (substring-no-properties (nth 2 row))))
                       (seq-drop (org-table-to-lisp) 2)))) ; load the table, drop the header

    ;; sort by weight (low to high)
    (setq templates (sort templates (lambda (a b) (< (car a) (car b))))
          ;; calc total weight
          total-weight (float
                        (seq-reduce (lambda (total item) (+ total (car item)))
                                    templates
                                    0)))

    ;; calculate number for each row
    (dotimes (ii (length templates))
      (let* ((item (nth ii templates))
             (weight (car item))
             (needed (cond ; number of problems to add for this template
                      ((= weight 0)
                       0)
                      ((= ii (1- (length templates)))
                       (- count (length problems)))
                      (t
                       (max (round (* (/ weight total-weight) count) ) 1))))
             (added 0)
             (dup-count 0)
             problem-set)
        (while (< added needed) ; add until "needed" are kept
          (let* ((fill-ret (org-mathsheet--fill-problem (caddr item)))
                 (problem (alist-get :problem fill-ret))
                 (alg-vars (alist-get :alg-vars fill-ret))
                 (calc-string (if (not alg-vars)
                                  problem
                                (format "solve(%s,[%s])"
                                        problem
                                        (string-join (seq-uniq alg-vars) ","))))
                 (solution
                  (replace-regexp-in-string (rx (or "[" ".]" "]"))
                                            ""
                                            (calc-eval `(,calc-string
                                                         calc-prefer-frac t
                                                         calc-frac-format ("/" nil))))))
            (cond
             ((member problem problem-set) ; dedup problems
              (setq dup-count (1+ dup-count))
              (when (> dup-count 100)
                ;; high number of dups indicates a narrow problem space relative to problem count
                (error "Giving up, too many dups")))
             (t
              (push problem problem-set)
              (push (list problem ; problem
                          solution ; solution
                          (cadr item) ; order
                          (not (null alg-vars))) ; true if algebraic variables exist
                    problems)
              (setq added (1+ added))))))))

    ;; shuffle
    (dotimes (ii (- (length problems) 1))
      (let ((jj (+ (random (- (length problems) ii)) ii)))
        (cl-psetf (elt problems ii) (elt problems jj)
               (elt problems jj) (elt problems ii))))

    ;; sort by order
    (sort problems (lambda (a b) (< (caddr a) (caddr b))))

    ;; return problems and answers, drop header
    problems))

;;;###autoload
