mathsheet.org
** Update problem-set block

This generates a problem set and writes it to the dynamic block. This
is triggered by @@html:<kbd>@@C-c@@html:</kbd>@@
@@html:<kbd>@@C-c@@html:</kbd>@@ on the dynamic block header or
footer.

~params~ is a property list of params on the block header line.

First we generate the problems and answers, then we write them out to
a table in the dynamic block, finally, if the user wants it, we
generate a PDF with these problems.

The reason for the yes/no prompt is to allow you to see the problem
set that was generated to decide if you want to use it or generate
another.

#+begin_src elisp :tangle org-mathsheet.el
  ;;;###autoload
  (defun org-dblock-write:problem-set (params)
    "Update problem-set block and optionally write a worksheet.

  PARAMS is a plist with the properties set on the dynamic block
  header, which includes `:tempates' which is the name of the
  templates table, `:count' which is the number of problems to put
  on the worksheet, `:prob-cols' for the number of columns to use
  for problems, and `:instruction' which is the content of the
  instruction line at the top of the page."

    ;; write the table header
    (insert "| problem | answer |\n")
    (insert "|-\n")

    ;; generate problem set
    (let ((problems (org-mathsheet--generate-problems
                     (plist-get params :templates)
                     (plist-get params :count))))

      ;; for each problem, write a row to the table
      (insert
       (mapconcat
        (lambda (problem) (format "| %s | %s |"
                                  (car problem)
                                  (cadr problem)))
        problems
        "\n"))

      ;; align table
      (org-table-align)

      ;; should we generate the sheet?
      (when (y-or-n-p "Write worksheet? ")
        (org-mathsheet--gen-worksheet
         (plist-get params :templates)
         (plist-get params :instruction)
         problems
         (plist-get params :prob-cols)))))
#+end_src

** Generate PDF
*** Lay out page
This wraps the problems with a LaTeX header and footer.

This template doesn't use noweb but it uses noweb syntax (~<<label>>~)
to mark where org-mathsheet will insert content. It's not possible
actually use noweb here since the problems and answers are coming from
elisp and generated at runtime. Instead this template must be tangled
to org-mathsheet.el as a template so the elisp functions can use it.

#+name: page
#+begin_src latex :exports code :results value silent
  \documentclass[12pt]{exam}
  \usepackage[top=1in, bottom=0.5in, left=0.8in, right=0.8in]{geometry}
  \usepackage{multicol}
  \usepackage{rotating}
  \usepackage{xcolor}

  \pagestyle{head}
  \header{Name:\enspace\makebox[2.2in]{\hrulefill}}{}{Date:\enspace\makebox[2.2in]{\hrulefill}}

  \begin{document}

    \noindent <<instruction>>

    \begin{questions}
      <<problems>>
    \end{questions}

    \vspace*{\fill}

    \vspace*{0.1cm}
    \noindent\rule{\linewidth}{0.4pt}
    \vspace*{0.1cm}

    \begin{turn}{180}
      \begin{minipage}{\linewidth}
        \color{gray}
        \footnotesize
        \begin{questions}
          <<answers>>
        \end{questions}
      \end{minipage}
    \end{turn}

  \end{document}
#+end_src
*** Convert calc to latex
This converts a calc expression to latex format. The problems and
answers are generated in standard emacs calc format. If they are to be
written to a PDF we convert them to latex. emacs calc already knows
how to convert between formats, so we let it do it.

#+name: convert-to-latex
#+begin_src elisp :tangle org-mathsheet.el
  (defun org-mathsheet--convert-to-latex (expr)
    "Format the given calc expression EXPR for LaTeX.

  EXPR should be in normal calc format.  The result is the same
  expression (not simplified) but in LaTeX format."
    (let* ((calc-language 'latex)
           (calc-expr (math-read-expr expr))
           (latex-expr (math-format-stack-value (list calc-expr 1 nil)))
           (latex-expr-cleaned (replace-regexp-in-string (rx "1:" (* space)) "" latex-expr)))
      (concat "\\(" latex-expr-cleaned "\\)")))
#+end_src
*** Write PDF
This inserts instruction line and generated problems into the page
template, writes it to a local file, then runs ~texi2pdf~ to build a
PDF. We save it as ~[template-name].tex~ and the final worksheet is
named ~[template-name].pdf~. Each execution with the same template name
will overwrite the same file.

#+begin_src elisp :results silent :tangle org-mathsheet.el
  (defun org-mathsheet--gen-worksheet (file-name instruction problems prob-cols)
    "Generate a worksheet with PROBLEMS.

  Write a file named FILE-NAME.  Include the INSTRUCTION line at the
  top.  The problems will be arranged in PROB-COLS columns.  The
  answers will be in 4 columns."
    (with-temp-file (concat file-name ".tex")
      (insert org-mathsheet--worksheet-template)

      (goto-char (point-min))
      (search-forward "<<instruction>>")
      (replace-match "")
      (insert instruction)

      (let ((answ-cols 5))
        (goto-char (point-min))
        (search-forward "<<problems>>")
        (replace-match "")
        (dolist (group (seq-partition problems prob-cols))
          (insert (format "\\begin{multicols}{%d}\n" prob-cols))
          (dolist (row group)
            (if (cadddr row)
                (insert (format"\\question %s\n"
                               (org-mathsheet--convert-to-latex (car row))))
              (insert (format"\\question %s = \\rule[-.2\\baselineskip]{2cm}{0.4pt}\n"
                             (org-mathsheet--convert-to-latex (car row))))))
          (insert "\\end{multicols}\n")
          (insert "\\vspace{\\stretch{1}}\n"))

        (goto-char (point-min))
        (search-forward "<<answers>>")
        (replace-match "")
        (dolist (group (seq-partition problems answ-cols))
          (insert (format "\\begin{multicols}{%s}\n" answ-cols))
          (dolist (row group)
            (insert (format "\\question %s\n"
                            (org-mathsheet--convert-to-latex (cadr row)))))
          (insert "\\end{multicols}\n"))))
    (call-process
     "texi2pdf" nil (get-buffer-create "*Standard output*") nil
     (concat  file-name ".tex")))
#+end_src
*** Footer
#+begin_src elisp :tangle org-mathsheet.el
(provide 'org-mathsheet)

;;; org-mathsheet.el ends here
#+end_src

* Literate Programming
This is written as a [[https://en.wikipedia.org/wiki/Literate_programming][literate program]] using [[https://orgmode.org/][emacs
org-mode]]. [[file:mathsheet.org][The org file]] contains the code and
documentation for the math worksheet generation script.  When this
file is saved, the source code is generated using =org-babel-tangle= and
the readme is generated using =org-md-export-to-file=.

The first line of [[file:mathsheet.org][the org file]] configures emacs to run those commands
whenever this file is saved, which generates the scripts and readme.
