org-mathsheet.el
(defun org-dblock-write:problem-set (params)
  "Update problem-set block and optionally write a worksheet.

PARAMS is a plist with the properties set on the dynamic block
header, which includes `:tempates' which is the name of the
templates table, `:count' which is the number of problems to put
on the worksheet, `:prob-cols' for the number of columns to use
for problems, and `:instruction' which is the content of the
instruction line at the top of the page."

  ;; write the table header
  (insert "| problem | answer |\n")
  (insert "|-\n")

  ;; generate problem set
  (let ((problems (org-mathsheet--generate-problems
                   (plist-get params :templates)
                   (plist-get params :count))))

    ;; for each problem, write a row to the table
    (insert
     (mapconcat
      (lambda (problem) (format "| %s | %s |"
                                (car problem)
                                (cadr problem)))
      problems
      "\n"))

    ;; align table
    (org-table-align)

    ;; should we generate the sheet?
    (when (y-or-n-p "Write worksheet? ")
      (org-mathsheet--gen-worksheet
       (plist-get params :templates)
       (plist-get params :instruction)
       problems
       (plist-get params :prob-cols)))))

(defun org-mathsheet--convert-to-latex (expr)
  "Format the given calc expression EXPR for LaTeX.

EXPR should be in normal calc format.  The result is the same
expression (not simplified) but in LaTeX format."
  (let* ((calc-language 'latex)
         (calc-expr (math-read-expr expr))
         (latex-expr (math-format-stack-value (list calc-expr 1 nil)))
         (latex-expr-cleaned (replace-regexp-in-string (rx "1:" (* space)) "" latex-expr)))
    (concat "$" latex-expr-cleaned "$")))

(defun org-mathsheet--gen-worksheet (file-name instruction problems prob-cols)
  "Generate a worksheet with PROBLEMS.

Write a file named FILE-NAME.  Include the INSTRUCTION line at the
top.  The problems will be arranged in PROB-COLS columns.  The
answers will be in 4 columns."
  (with-temp-file (concat file-name ".tex")
    (insert org-mathsheet--worksheet-template)

    (goto-char (point-min))
    (search-forward "<<instruction>>")
    (replace-match "")
    (insert instruction)

    (let ((answ-cols 5))
      (goto-char (point-min))
      (search-forward "<<problems>>")
      (replace-match "")
      (dolist (group (seq-partition problems prob-cols))
        (insert (format "\\begin{multicols}{%d}\n" prob-cols))
        (dolist (row group)
          (if (cadddr row)
              (insert (format"\\question %s\n"
                             (org-mathsheet--convert-to-latex (car row))))
            (insert (format"\\question %s = \\rule[-.2\\baselineskip]{2cm}{0.4pt}\n"
                           (org-mathsheet--convert-to-latex (car row))))))
        (insert "\\end{multicols}\n")
        (insert "\\vspace{\\stretch{1}}\n"))

      (goto-char (point-min))
      (search-forward "<<answers>>")
      (replace-match "")
      (dolist (group (seq-partition problems answ-cols))
        (insert (format "\\begin{multicols}{%s}\n" answ-cols))
        (dolist (row group)
          (insert (format "\\question %s\n"
                          (org-mathsheet--convert-to-latex (cadr row)))))
        (insert "\\end{multicols}\n"))))
  (shell-command (concat "texi2pdf " file-name ".tex")
                 (get-buffer-create "*Standard output*")))

(provide 'org-mathsheet)

;;; org-mathsheet.el ends here
